{
  "name": "Polos Electronics Inc",
  "rating": 4.8,
  "total_ratings": 14,
  "reviews": [
    {
      "author": "Robert Molidor",
      "rating": 5,
      "text": "I had a couple guys from Polos do an Ethernet retrofit on my home. Not only were they friendly and relatable, they got the job done in two hours and the total came out under the quote. The quality of work was great and aligned with the ask without any nonsense. I’m impressed with the vibes of the folks that completed the job and I would recommend them as a top pick for their line of work. I can’t wait to find a reason to hire them again.",
      "time": "a year ago",
      "profile_photo": "https://lh3.googleusercontent.com/a-/ALV-UjXhf5Up8vOTWi8E0FXqDZMEUnRHwaeTss8xw00sR-HbuZmIBYDW=s128-c0x00000000-cc-rp-mo-ba3"
    },
    {
      "author": "Jerry Danna",
      "rating": 5,
      "text": "Great company to do business with. My Bose system was not working. I gave up on trying to get it fixed. I contacted Polos and was ready to buy a whole new sound system amplifier and sound bar. Polos arrived and spent more time than I would have thought on diagnosing the problem ( I told them I was ready to buy a new system ). Bottom line - they got my Bose system up and running and only charged me for a couple hours of their time. They by-passed the opportunity for a quick ( but not necessary in retrospect ) sale of new equipment and instead repaired my existing equipment.  Very ethical.\nJerry D.",
      "time": "2 years ago",
      "profile_photo": "https://lh3.googleusercontent.com/a/ACg8ocLJw8ViVqpmQEWqItQLfCMs2-LnCAyEg5XSSlqk4J5ClIleQg=s128-c0x00000000-cc-rp-mo"
    },
    {
      "author": "Gary Bryson",
      "rating": 2,
      "text": "I would rate them a five but after several attempts and 3 1/2 months to get them back and finish the install (missing faceplate) they get a two for poor customer service!! Polos still has not installed the faceplate!",
      "time": "2 years ago",
      "profile_photo": "https://lh3.googleusercontent.com/a/ACg8ocJFlwUwBJiolWwwzL0tM4_oRxpZWrudlKA2wzIER6kJDu52GQ=s128-c0x00000000-cc-rp-mo"
    },
    {
      "author": "Eric E (My Boring Channel)",
      "rating": 5,
      "text": "Nothing but the best! Polos did a great job on my home theater system. Couldn't ask for anything more. The price was right and the system looks and sounds amazing! They moved the speakers around to the correct places in my room and also installed four in-ceiling atmos speakers. Then they wall mounted the TV and hid all the wires in the wall! AWESOME!",
      "time": "6 years ago",
      "profile_photo": "https://lh3.googleusercontent.com/a-/ALV-UjXmtBzf3Jr7bxBgF57ARc6L92UwmdAOlSnZR4BGhenOVj76R6HR9A=s128-c0x00000000-cc-rp-mo-ba5"
    },
    {
      "author": "Haris Hadziselimovic",
      "rating": 5,
      "text": "We had Polos Electronics come out to do all the electronics for our new home and we couldn't be happier. They put in our speaker system throughout the entire home, set up Tv's, wireless stations and an alarm system. They were on time, efficient, priced right and professional. Anytime we had a question prior and after install they were readily available and happy to help. If you are looking for a surround sound or any type of home electronics, call Polos as they're top notch and you will be very happy!",
      "time": "10 years ago",
      "profile_photo": "https://lh3.googleusercontent.com/a-/ALV-UjVzyouRl9WF-MNG3-cHIY9kJceufA67xPF4-bDvlpHYxs1H6p14=s128-c0x00000000-cc-rp-mo-ba3"
    }
  ]
}
